Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: NOTE: There is a performance hit as the texture is uploaded to texture memory on most devices, so it's recommended that you call sprite_preftech on any required graphics at the start of a level to avoid any stalls.
zh_cn: 注意： There is a performance hit as the texture is uploaded to texture memory on most devices, so it's recommended that you call sprite_preftech on any required graphics at the start of a level to avoid any stalls.

source: NOTE: There is a performance hit as the texture is uploaded to texture memory on most devices, so you can call sprite_prefetch on any required graphics at the start of a level to avoid any stalls.
zh_cn: 注意： There is a performance hit as the texture is uploaded to texture memory on most devices, so you can call sprite_prefetch on any required graphics at the start of a level to avoid any stalls.

source: NOTE: These functions do not work when the target module is HTML5.
zh_cn: 注意： These functions do not work when the target module is HTML5.

source: NOTE: These functions are Windows ONLY
zh_cn: 注意： These functions are Windows ONLY

source: NOTE: These functions do not work on the actual files!
zh_cn: 注意： These functions do not work on the actual files!

source: NOTE: This action is only for use in the various Draw Events, and will not draw anything if used elsewhere.
zh_cn: 注意： This action is only for use in the various Draw Events, and will not draw anything if used elsewhere.

source: NOTE: This action will only clear the visible particles in the room, but it does not clear the particle properties nor does it remove them from memory.
zh_cn: 注意： This action will only clear the visible particles in the room, but it does not clear the particle properties nor does it remove them from memory.

source: NOTE: This does not free the data structure from memory and only clears it of any information.
zh_cn: 注意： This does not free the data structure from memory and only clears it of any information.

source: NOTE: This event will, by default, draw 1:1 with the application surface size, which is normally the size of the room or the view port.
zh_cn: 注意： This event will, by default, draw 1:1 with the application surface size, which is normally the size of the room or the view port.

source: NOTE: This feature currently only supports files created using the program Spine.
zh_cn: 注意： This feature currently only supports files created using the program Spine.

source: NOTE: This function can only be used in the Draw Event.
zh_cn: 注意： This function can only be used in the Draw Event.

source: NOTE: This function is limited to the iOS and Android target modules.
zh_cn: 注意： This function is limited to the iOS and Android target modules.

source: NOTE: This function is only valid for the Windows target.
zh_cn: 注意： This function is only valid for the Windows target.

source: NOTE: This function is primarily for use with Compatibility Scripts for imported projects and the converted code for Drag and Drop actions.
zh_cn: 注意： 该函数基本上是用于所导入工程的兼容性脚本（Compatibility）及拖拽按钮（Drag and Drop）动作转换而成的代码中的。

source: NOTE: This function will not work with vector sprites or skeleton animation sprites.
zh_cn: 注意： This function will not work with vector sprites or skeleton animation sprites.

source: NOTE: This function works within the scope of the current target room - by default the room in which the function is called - which can be set using the function layer_set_target_room().
zh_cn: 注意： This function works within the scope of the current target room - by default the room in which the function is called - which can be set using the function layer_set_target_room().

source: NOTE: This functionality is limited to the iOS and Android target modules.
zh_cn: 注意： This functionality is limited to the iOS and Android target modules.

source: NOTE: This is available on the standard Windows target module only.
zh_cn: 注意： 命令行参数仅在标准 Windows 目标模块有效。

source: NOTE: This may not always be necessary and the performance increase from this method will depend on whether the target device is CPU bound or GPU bound.
zh_cn: 注意： This may not always be necessary and the performance increase from this method will depend on whether the target device is CPU bound or GPU bound.

source: NOTE: This option is only available for bitmap sprites and will be greyed out for SWF or skeleton animation sprites.
zh_cn: 注意： This option is only available for bitmap sprites and will be greyed out for SWF or skeleton animation sprites.

source: NOTE: This page references GML for writing scripts, but you can also create scripts using Drag and Drop (see here) .
zh_cn: 注意： This page references GML for writing scripts, but you can also create scripts using Drag and Drop (see here) .

source: NOTE: Tiles are always square, so if you need anything other than that, you should be using an instance with a sprite or an asset layer in the room editor.
zh_cn: 注意：图块 一般是正方形的，所以如果你需要制作其他形状，那么应该在房间编辑器中使用其他形状实例组成的精灵或在资源图层中制作。

source: NOTE: To be able to create or use asset packages, you must have previously created a user profile certificate.
zh_cn: 注意： To be able to create or use asset packages, you must have previously created a user profile certificate.

source: NOTE: Using collision groups dramatically increases the processing required by the physics system and should be used only when absolutely necessary, and you should have as few groups as possible.
zh_cn: 注意： Using collision groups dramatically increases the processing required by the physics system and should be used only when absolutely necessary, and you should have as few groups as possible.

source: NOTE: We recommend that you take a screenshot of the actual settings as well as make a copy of the PEM file.
zh_cn: 注意： 我们建议对具体设置屏幕截图，以及备份PEM文件。

source: NOTE: When generating a random integer the action will return an integer value between the minimum and maximum value inclusive, so a range of 5 - 10 could return 5 or 10 as well as any integer in between.
zh_cn: 注意： When generating a random integer the action will return an integer value between the minimum and maximum value inclusive, so a range of 5 - 10 could return 5 or 10 as well as any integer in between.

source: NOTE: When it comes to uploading your app to the store you will need to get the correct *.pfx for your title.
zh_cn: 注意： When it comes to uploading your app to the store you will need to get the correct *.pfx for your title.

source: NOTE: When you build a new matrix in this way the order of operation is YXZ.
zh_cn: 注意： When you build a new matrix in this way the order of operation is YXZ.

source: NOTE: While this section deals with scripts, the code window that you write your scripts in is the same as that for Events, room or instance creation code or Shaders, and the functionality outlined here applies to all of them.
zh_cn: 注意： While this section deals with scripts, the code window that you write your scripts in is the same as that for Events, room or instance creation code or Shaders, and the functionality outlined here applies to all of them.

source: NOTE: With the included files and extensions you can select a target platform for them to export to.
zh_cn: 注意： With the included files and extensions you can select a target platform for them to export to.

source: NOTE: You can't use a matrix constant as an argument with this function, so if you wish to multiply the (for example) view matrix with a custom matrix that you have built, you must first call matrix_get(type) and assign the view matrix values to an array variable, then multiply it by your custom matrix, and then set the chosen matrix (view, projection or world).
zh_cn: 注意： You can't use a matrix constant as an argument with this function, so if you wish to multiply the (for example) view matrix with a custom matrix that you have built, you must first call matrix_get(type) and assign the view matrix values to an array variable, then multiply it by your custom matrix, and then set the chosen matrix (view, projection or world).

source: NOTE: You cannot copy to the same buffer.
zh_cn: 注意： You cannot copy to the same buffer.

source: NOTE: You cannot draw in this event!
zh_cn: 注意： You cannot draw in this event!

source: NOTE: You may also need to temporarily switch off hidden surface removal if you want the information to be drawn regardless of the current depth value.
zh_cn: 注意： You may also need to temporarily switch off hidden surface removal if you want the information to be drawn regardless of the current depth value.

source: NOTE: You should be aware that due to XSS protection in browsers, requests to and attempts to load resources from across domains are blocked and may appear to return blank results when using any of the following events
zh_cn: 注意： You should be aware that due to XSS protection in browsers, requests to and attempts to load resources from across domains are blocked and may appear to return blank results when using any of the following events

source: NOTE: this function does not work on the Android platform.
zh_cn: 注意： this function does not work on the Android platform.

source: NOTE: this function will only work with the HTML5 target module.
zh_cn: 注意： this function will only work with the HTML5 target module.

source: NOTE: you can find out more about the different data types here.
zh_cn: 注意： you can find out more about the different data types here.

source: New Drag and Drop Project: This will create a new project in which the Object Editor (and any other editors that permit code) will be set up to use the GameMaker Studio 2 Drag and Drop interface.
zh_cn: 新建拖拽按钮项目（New Drag and Drop Project）: 这将创建一个新的项目，其中 物体编辑器（Object Editor） (以及允许代码的其他编辑器) 将被设置为使用 GameMaker Studio 2 拖拽按钮（Drag and Drop） 界面。

source: New GameMaker Language Project: This will create a project where the default programming is done using the GameMaker Language (GML).
zh_cn: 新建GML工程文件（New GameMaker Language Project）: 这将创建一个项目，默认程序使用的是GameMaker Language (GML).

source: New Project - This is for creating a new project from scratch in GameMaker Studio 2.
zh_cn: 新建项目（New Project） - 该选项可以在 GameMaker Studio 2 中创建一个全新的项目（工程）

source: Node selection highlight: This is the colour that will be used to highlight any selected nodes within the resource tree.
zh_cn: 节点选择高亮: 用于突出资源树中选定节点的颜色。

source: Notification timeout (ms): This sets the length of time (in milliseconds) that a notification is shown for.
zh_cn: 通知超时（毫秒）: 此选项设置通知显示的时长（毫秒）。

source: Object double click opens all object events: By default double clicking on any resource will open that resource for editing, but often when dealing with objects, after the initial setup when you create the new resource, you open it to edit the events only rather than the object properties.
zh_cn: 双击物体打开所有物体的事件: 默认情况下，双击 任何资源都将打开该资源的编辑器，但对于精灵，在创建新资源并初始设置后，双击打开它进入编辑图像界面而不是编辑精灵属性。

source: Objects - 15
zh_cn: 物体（Objects） - 15

source: Open Manual - Opens the help document.
zh_cn: 打开帮助文档 - 打开帮助文档。

source: Open Project In Explorer - This will open the save location of the currently loaded project in the OS file explorer.
zh_cn: 在资源管理器中打开项目 - 该选项将会在操作系统的文件资源管理器中打开保存当前被载入项目的位置。

source: Open Project - This will open the GameMaker Studio 2 file explorer for you to select a previously created *.yyp project file for loading.
zh_cn: 打开项目 - 该选项会打开 GameMaker Studio 2 的文件浏览器来供你选择以前创建过的 *.yyp 项目文件并载入。

source: Open Properties - Open the resource properties editor for the clicked resource (note that you can double click too).
zh_cn: 打开属性 - 打开所点击资源类型的资源属性编辑器（请注意，您也可以双击 ）。

source: Open automatically on Project load: When enabled, the Recent Windows list will be shown when you load a new project.
zh_cn: 在项目加载时自动打开: 启用该选项，将在加载新项目时显示最近窗口列表。

source: Open event scripts as tabs in same window - When adding code or Drag and Drop to an event, the code window is chained to the event window, and when this option is checked any further events that are opened for editing will be added to the same window as tabs along the top.
zh_cn: 在同一个窗口以标签的形式打开事件脚本 - 添加脚本或者拖拽到一个事件中时，代码窗口将链接到事件窗口，然而当这个选项被勾选时，任何之后打开编辑的事件将添加到同一个窗口中，沿着窗口的顶部依次添加。

source: Open in Explorer - This will open the file explorer on the location of the file that has been stored for the resource in your project folder.
zh_cn: 在资源管理器中打开 - 打开文件资源管理器，该文件位于项目文件夹中资源文件的位置。

source: Open linked scripts as tabs in same window - When you have multiple linked scripts and open them, by default they will be grouped n the same window as tabs.
zh_cn: 在同一个窗口以标签的形式打开链接的脚本 - 当你拥有多个链接的脚本并且打开它们，默认它们将分组 在相同的窗口中以标签的形式打开。

source: Open new moments for edit on creation: Normally when you add a new moment to a timeline, GameMaker Studio 2 will automatically open the editor for you to add your code or Drag and Drop to it.
zh_cn: 创建时立即打开新的时刻点开始编辑: 通常，当您向时间轴添加新的时刻时，GameMaker Studio 2 将自动打开编辑器，以添加代码或拖放模块到其中。

source: Open new resources for edit on creation: If this is checked, every time you create a new resource in the Resource Tree, the corresponding resource editor will be opened automatically.
zh_cn: 创建时总是打开新资源的编辑窗口: 如果勾选该选项，每次在资源树中创建新资源，都会自动打开资源编辑器。

source: Open new resources for edit on dragging files into IDE: Certain resources (like sprites or sounds) can be dragged onto the main Workspace in the GameMaker Studio 2 IDE and will be detected and added as a new resource in the Resource Tree.
zh_cn: 在将文件拖入IDE时打开新资源进行编辑: 某些资源（如精灵或声音）可以拖放到 GameMaker Studio 2 IDE 的主工作区中，并将添加到资源树中作为新资源使用。

source: Open object events in full screen editor - Checking this option will make object event code editors open automatically in a new workspace.
zh_cn: 在全屏编辑器中打开物体事件 - 勾选此项将自动在新的工作区打开物体事件代码。

source: Open scripts in full screen editor - Checking this option will make script resources open automatically in a new workspace.
zh_cn: 在全屏编辑器中打开脚本 - 勾选此项将让脚本自动在新的工作区打开。

source: Open shaders in full screen editor - Checking this option will make shader resources open automatically in a new workspace.
zh_cn: 在全屏编辑器中打开着色器 -勾选此项将使着色器自动在新的工作区打开。

source: Open the image editor when double clicking on a sprite resource: By default double clicking on any resource will open that resource for editing, but often when dealing with sprites, after the initial setup when you create the new resource, you open it to edit the image rather than the sprite properties.
zh_cn: 双击精灵资源打开图像编辑器（Open the image editor when double clicking on a sprite resource）：默认双击任何资源都将打开编辑，但是经常在处理精灵的时候，你创建新的资源的初始化设置之后，你打开它编辑图像而不是精灵属性。

source: Opt-in To Feedback Surveys: When this option is checked, you are telling GameMaker Studio 2 that you wish to participate in feedback surveys, meaning that occaisionally while working a message will be shown about the area you are working on and request a rating and feedback.
zh_cn: 选择性反馈调查: 当勾选此选项，意味着你告诉 GameMaker Studio 2 你希望参与反馈调查，这意味着在工作时将显示关于你正在工作的区域的信息，并请求评级和反馈。

source: Options for Diff Tool: In this field you can add any extra commands to be run whenever you use the Diff Tool.
zh_cn: 差异工具选项: 在此字段你可以添加任何额外的命令，在使用差异工具时都将运行。

source: Options for Merge Tool: In this field you can add any extra commands to be run whenever you use the Merge Tool.
zh_cn: 合并工具选项：在此字段你可以添加任何额外的命令，在使用合并工具时都将运行。

source: Orange - Debug update time, which is only normally visible when you use the debug module
zh_cn: 橙色 - 调试更新时间，在使用调试模块时通常只能看到该部分

source: Pan text editor into view on focus - When you open a text editor from an object event, selecting this option will automatically pan the workspace to bring the editor to within the bounds.
zh_cn: 平移文本编辑器进入焦点视图 - 从物体事件打开文本编辑器时，打开此选项将自动平移工作区以使编辑器处于可视范围内。

source: Password for username: Here you must enter the password associated with the username that you give above.
zh_cn: 用户密码（Password for username）：在这里，你必须输入上面提供的用户名关联的密码。

source: Path Rotation Sensitivity - Set the sensitivity for rotating paths.
zh_cn: 路径旋转敏感度（Path Rotation Sensitivity） - 设置路径旋转的敏感度。

source: Path Scale Sensitivity - Set the sensitivity for scaling paths.
zh_cn: 路径放大的敏感度 - 设置放大路径的敏感度。

source: Path colour - The colour to be used to show the path as you edit it.
zh_cn: 路径颜色 - 设置在编辑路径时用于显示路径的颜色。

source: Path to Diff Tool: Here you specify the full file path to the Git diff tool.
zh_cn: 差异工具位置: 在此处指定 Git 差异工具的完整文件路径。

source: Path to Merge Tool: Here you specify the full file path to the Git merge tool.
zh_cn: 合并工具位置：在此处指定 Git 合并工具的完整文件路径。

source: Path to external editor/viewer for SWF files: If you are working with SWF format sprites, you can set this to the path of your preferred viewer/editor and when you click the Edit Image button in the Sprite Editor then it will open the given program.
zh_cn: SWF文件的外部编辑器/查看器（Path to external editor/viewer for SWF files）：如果你要处理SWF类型的精灵，你可以将该选项设置为你喜欢的查看器/编辑器的路径，并且当你在精灵编辑器（Sprite Editor）中点击编辑精灵（Edit Sprite）按钮的时候，它会打开被给定的程序。

source: Path to external editor/viewer for Spine files: If you are working with Spine format sprites, you can set this to the path of your preferred viewer/editor and when you click the Edit Image button in the Sprite Editor then it will open the given program.
zh_cn: Spine文件的外部编辑器/查看器（Path to external editor/viewer for Spine files）：如果你要处理Spine类型的精灵，你可以将该选项设置为你喜欢的查看器/编辑器的路径，并且当你在精灵编辑器（Sprite Editor）中点击编辑精灵（Edit Sprite）按钮的时候，它会打开被给定的程序。

source: Paths - 5 (no dynamic path creation permitted)
zh_cn: 路径（Paths） - 5 （不允许创建动态路径）

source: Persistent - A persistent object is one that does not go away when the room is changed, but rather it "persists" and is carried over into the new room.
zh_cn: 持久化 - 持久化物体是房间改变时不会消失的物体，而是“持续存在”并被转移到新房间中。

source: Point size - Set the size of the different anchor points and control points to be used.
zh_cn: 点大小 - 设置不同锚点和控制点的大小。

source: Port for Debugger to use: This sets the port number for the Debug Module to use.
zh_cn: 调试器使用的端口（Port for Debugger to use）：该选项设置调试模块所使用的网络端口。

source: Port number to use for the web server: This sets the port number for the micro web server to use.
zh_cn: 网络服务器所使用的端口（Port number to use for the web server）：该选项设置了供MWS使用的端口号。

source: Preferences - Selecting this will take you to the Preferences Windows where you can set up how GameMaker Studio 2looks and feels.
zh_cn: 偏好设置（Preferences） - 选择该项将会带你到 偏好设置（Preferences）窗口，在这里你可以设置 GameMaker Studio 2 的外观和操作感。

source: Publisher Name: This is the name that will be used as the Publisher name for the asset.
zh_cn: 发布者名称（Publisher Name）：此处名称将用于资源发布者的名字。

source: Recent Projects - You can use this option to view recently used projects.
zh_cn: 最近项目（Recent Projects） - 您可以使用该选项来查看近期使用过的项目。

source: Red - The update speed of the step event
zh_cn: 红色 - 步事件的更新速度

source: Redo - Redo a previous action.
zh_cn: 重做（Redo） - 重做上一步动作。

source: Release Notes - This will open the Release Notes for GameMaker Studio 2 in your browser.
zh_cn: 版本说明 - 该选项会在你的浏览器中打开 GameMaker Studio 2 的 版本发行信息。

source: Rename - Rename the resource or the group folder.
zh_cn: 重命名 - 重命名资源或资源组文件夹。

source: Report A Bug - Should you find any bugs or have any issues while using GameMaker Studio 2 you can report them here.
zh_cn: 报告 BUG - 如果您在使用 GameMaker Studio 2 时发现任何错误或感觉存在任何问题，您可以 在此处提交。

source: Required SDKs - Due to the cross-platform nature of GameMaker Studio 2 a number of 3rd party SDK's are required.
zh_cn: 必需的 SDK - 由于GameMaker Studio 2跨平台开发的本性，有一些第三方的开发工具包（SDK）是必需的。

source: Reset Layout - This will reset the current IDE layout to the default settings.
zh_cn: 重置布局（Reset Layout） - 该选项会将IDE布局重置为默认设定。

source: Resource font can scale above 100%: When you select this option and then change the resource item size scale, then you can force GameMaker Studio 2 to increase the text size as well as the icon size for items in the resource tree when set to greater than 100%.
zh_cn: 字体资源可以放大到 100% 以上: 若您打开此选项，然后更改资源项目大小，当设置为大于100％时您可以强制 GameMaker Studio 2 放大文本以及资源树中项目的图标。

source: Resource font can scale below 100%: When you select this option and then change the resource item size scale, then you can force GameMaker Studio 2 to reduce the text size as well as the icon size for items in the resource tree when set to less than 100%.
zh_cn: 字体资源可以缩小到 100% 以下: 若您打开此选项，然后更改资源项目大小，当设置为小于100％时您可以强制 GameMaker Studio 2 缩小资源树中的文本以及图标。

source: Restore Default: If you have changed the background image to be something other than the default image, you can restore the default using this button at any time.
zh_cn: 恢复默认（Restore Default）：如果你改变了背景图而不是使用默认图像，你可以随时通过这个按钮来重置为默认图像

source: Returns: Array
zh_cn: 返回： 数组

source: Returns: Boolean
zh_cn: 返回: 布尔值

source: Returns: Constant
zh_cn: 返回： 常量

source: Returns: N/A
zh_cn: 返回： N/A

source: Returns: N/A.
zh_cn: 返回： N/A

source: Returns: Pointer
zh_cn: 返回： 指针

source: Returns: Real
zh_cn: 返回： 实数

source: Returns: String
zh_cn: 返回： 字符串

source: Returns: real
zh_cn: 返回： 实数

source: Returns:Constant
zh_cn: 返回:常量

source: Returns:N/A
zh_cn: 返回：N/A

source: Room Properties: Rooms have a number of properties too, and these can be set here.
zh_cn: 房间属性: 房间也有一些属性，可以在这里设置。

source: Rooms - 5 (no dynamic room creation permitted)
zh_cn: 房间（Rooms） - 5（不允许创建动态房间）

source: Run - Run your current project on the chosen target platform for testing.
zh_cn: 运行 - 在选中的平台上运行你当前的项目用于测试。

source: Save Layout - This will open a file explorer where you can name and save the current IDE layout as an *.xml file.
zh_cn: 保存布局（Save Layout） - 该选项会打开一个文件资源管理器，在这里你可以命名并保存当前IDE布局为一个 *.xml 文件。

source: Save Project As - Same as above, only you specify the location and the new name of the project.
zh_cn: 另存项目为（Save Project As） - 同上，只是你需要另存的新位置及新名称。

source: Save Project - This will save your game to the same location as you defined when you created the project (or where you opened it from).
zh_cn: 保存项目（Save Project） - 该选项将会保存你的游戏到你创建项目时候所定义的位置。（或者是你打开它的位置）

source: Scripts - 10
zh_cn: 脚本（Scripts） - 10

source: Scroll lock time (ms): This option deals with the time that GameMaker Studio 2 should wait between scrolling windows that are overlapping.
zh_cn: 滚动锁定时间（毫秒）: 此选项设置 GameMaker Studio 2 应该在重叠的滚动窗口之间等待的时间。

source: Scroll speed: This controls the scrolling speed within the different workspaces.
zh_cn: 滚动速度: 控制不同工作区内的滚动速度。

source: Search and replace - This will open a search window which permits you to search through your entire code (including room creation code, scripts, and events) for a given input - see below for further information.
zh_cn: 查找与替换（Search and replace） - 它会打开一个搜索窗口，使你能够在整个代码（包括房间创建时代码、脚本以及事件）中查找所输入内容 - 更多信息参见下文。

source: Select the IDE skin to use: Here you can select from the different skins that the IDE can use.
zh_cn: 选择使用的IDE皮肤（Select the IDE skin to use）：此处你可以选择IDE所能使用的各种皮肤。

source: Selected anchor point colour - The colour to be used to draw the path anchor points that have been highlighted (selected).
zh_cn: 选中的锚点颜色 - 设置用于绘制已突出显示（选择）的路径锚点的颜色。

source: Selected invalid anchor point colour - The colour to be used to draw the anchor points that are highlighted but invalid.
zh_cn: 选中的无效锚点颜色 - 设置用于绘制突出显示但无效的锚点的颜色。

source: Selected point colour - Set the colour to be used for any selected anchor points on the spline/arc.
zh_cn: 选定点颜色 - 设置选定锚点的颜色。

source: Selection frame colour for locked items in the room: Sets the colour of the frame that surrounds a selection for assets that have been locked.
zh_cn: 房间内锁定的项目的选择框颜色（Selection frame colour for locked items in the room）：设置环绕被锁定的资源的选择框的颜色。

source: Selection outline colour 1: The section outline is a dashed line that alternates between two colours.
zh_cn: 选区边框颜色 1（Selection outline colour 1）：选区边框是一条两种颜色交替出现的虚线。

source: Selection outline colour 2: The section outline is a dashed line that alternates between two colours.
zh_cn: 选区边框颜色 2（Selection outline colour 2）：选区边框是一条两种颜色交替出现的虚线。

source: Selection outline primary colour: The section outline is a dashed line that alternates between two colours.
zh_cn: 选中轮廓颜色 1: 截面轮廓是两种颜色之间交替的虚线。

source: Selection outline secondary colour: The section outline is a dashed line that alternates between two colours.
zh_cn: 选中轮廓颜色 2: 截面轮廓是两种颜色之间交替的虚线。
